Revit 2026 API

# Transform1D(Double, Double) Constructor

---

Constructs the transformation by specifying the scale and the translation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform1D(
	double scale,
	double translation
)
```
```vb
Public Sub New (
	scale As Double,
	translation As Double
)
```
```cpp
public:
Transform1D(
	double scale,
	double translation
)
```
```fsharp
new :
        scale : float *
        translation : float -> Transform1D
```

#### Parameters

scale Double
     The scale of the transformation.
translation Double
     The translational part of the transformation.

1D space is tranformed according to the following formula: t --> scale*t + translation

#### Reference

Transform1D Class

Transform1D Overload

Autodesk.Revit.DB Namespace